#+SETUPFILE: ./setup.org
#+TITLE: HIS389: Science, Technology, Modernity
#+ODT_STYLES_FILE: "/home/matt/.emacs.d/Templates/syl-temp-2019.odt"
#+IS_PUBLIC: t

* Course Requirements:
Your grade consists of the following components:

|   | Assignment       | Due Date | Weight |
|---+------------------+----------+--------|
| # | Midterm "Exam" 1 | <2019-10-03 Thu>  |     25 |
| # | Midterm "Exam" 2 | <2019-11-14 Thu>  |     25 |
| # | Paper Proposal   | <2019-11-19 Tue>  |     10 |
| # | Final Paper      | <2019-12-05 Thu>  |     30 |
| # | Participation    | n/a      |     10 |
|---+------------------+----------+--------|
|   |                  |          |    100 |
#+TBLFM: @>$>=vsum(@I..@II)
# #+TBLFM: $>=$>>(100/@>$4)::@>$>>=vsum(@I..@II)

The "*Exams*" are take-home assignments somewhere between an ordinary midterm and a short paper. Though untimed, they are intended to be written in a finite time period over the course of just a few days. Each exam will ask you to write approximately two short essays in response to the class readings.

The *Paper Assignment* asks you to explore one or more of the course texts on your own. Using the class bibliography as a starting point if you wish, you will write a medium-length paper (10-12pp) analyzing, interpreting, and contextualizing the primary text. A paper proposal is due several weeks before the paper itself.  

Extensions granted for medical reasons only. Late assignments will be deducted 3% per day, with the exception of the take-home exams, which /will be marked “0” if not handed in by 5:00 PM on the due date/. Please note: the paper proposal is /required/, and term papers will not be accepted if a proposal is not handed in.

** {{{n}}} ({{{ts}}}) Science and Totalitarianism  
:PROPERTIES:
:GRADE:    1
:END:
- We'll discuss
   Mario Biagioli
   Horkneimer & Adorno
   Scott

#+begin_src emacs-lisp
(let ((mylist '(2 1)))
  (cl-loop for i from 3 to 7
           do
           (add-to-list 'mylist i ))
(nth 2 mylist))
#+end_src

#+RESULTS:
: 5

#+begin_src emacs-lisp
(mwp-get-ts+7 'mwp-classtimes-calibrate)
#+end_src

#+RESULTS:
: <2019-01-10 Thu>

#+begin_src emacs-lisp :results code
(add-hook 'mwp-show-macros-final-hook #'hack-local-variables t)
(run-hooks 'mwp-show-macros-final-hook)
;; mwp-show-macros-final-hook
mwp-classtimes-calibrate
#+end_src


#+RESULTS:
#+begin_src emacs-lisp
("<2019-01-03 Thu>" "<2019-01-01 Tue>")
#+end_src

#+begin_src emacs-lisp :results code
;;(hack-local-variables)
mwp-classtimes-calibrate
(alist-get 'mwp-classtimes-calibrate file-local-variables-alist)
#+end_src

#+RESULTS:
#+begin_src emacs-lisp
("<2019-01-03 Thu>" "<2019-01-01 Tue>")
#+end_src

#+begin_src emacs-lisp
(let ((l 
       (make-list 3 (format "<%s>" (format-time-string "%Y-%m-%d %a" )))))
  (symbol-name 'l))
#+end_src

#+RESULTS:
: l

* COMMENT Variables
#+begin_src emacs-lisp
(make-local-variable 'org-use-property-inheritance)
(setq org-use-property-inheritance nil)
(setq org-lms-baseurl "https://q.utoronto.ca/api/v1/")
(setq org-lms-token (password-store-get "q.utoronto.ca"))
;;(org-lms-set-keyword "ORG_LMS_COURSEID" 64706)

;; (org-lms-setup)
#+end_src

#+RESULTS:
: 11834~96SJ9HQecRwc6mUcePZGPNuwfGuqbyhRVedkAuPBxcZTew6cRkVw0gUITZPN2U7b

#+begin_src emacs-lisp
(symbol-value 'mwp-classtimes-calibrate)
#+end_src

#
# Changes not staged for commit:
#+RESULTS:
| <2019-01-03 Thu> | <2019-01-01 Tue> |

local variables need to be set at the end of the file.

